Revit 2024 API
SpecUtils.IsSpec Method
 Checks whether a ForgeTypeId identifies a spec.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static bool IsSpec(
	ForgeTypeId specTypeId
)
Visual Basic
Public Shared Function IsSpec ( _
	specTypeId As ForgeTypeId _
) As Boolean
Visual C++
public:
static bool IsSpec(
	ForgeTypeId^ specTypeId
)
Parameters
specTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 The identifier to check.
Return Value
 True if the ForgeTypeId identifies a spec, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
SpecUtils Class
Autodesk.Revit.DB Namespace